# Working with text data

In [45]:
import pandas as pd

In [46]:
ale=pd.read_csv('CSV Folder/text.txt',header=None,names=['Name','Age'])
ale

              Name  Age
1      Krishna Ale   53
2    Sanu Maya Ale   44
3        Suman Ale   26
4      Srijana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21
7       Sushan Ale    1

In [47]:
ale['Name']=ale['Name'].str.title()
ale

              Name  Age
1      Krishna Ale   53
2    Sanu Maya Ale   44
3        Suman Ale   26
4      Srijana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21
7       Sushan Ale    1

In [48]:
ale['Name'].str.lower()

1        krishna ale
2      sanu maya ale
3          suman ale
4        srijana ale
5    sujan ale magar
6    suraj ale magar
7         sushan ale
Name: Name, dtype: object

In [49]:
ale['Name'].str.title()

1        Krishna Ale
2      Sanu Maya Ale
3          Suman Ale
4        Srijana Ale
5    Sujan Ale Magar
6    Suraj Ale Magar
7         Sushan Ale
Name: Name, dtype: object

In [50]:
ale['Name'].str.len()

1    11
2    13
3     9
4    11
5    15
6    15
7    10
Name: Name, dtype: int64

In [51]:
ale['Name'].str.replace('Ale','Magar')

1        Krishna Magar
2      Sanu Maya Magar
3          Suman Magar
4        Srijana Magar
5    Sujan Magar Magar
6    Suraj Magar Magar
7         Sushan Magar
Name: Name, dtype: object

In [52]:
ale

              Name  Age
1      Krishna Ale   53
2    Sanu Maya Ale   44
3        Suman Ale   26
4      Srijana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21
7       Sushan Ale    1

In [65]:
ale[ale['Name'].str.startswith(('S','K'))]

              Name  Age
1      Krishna Ale   53
2    Sanu Maya Ale   44
3        Suman Ale   26
4      Srijana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21
7       Sushan Ale    1

In [66]:
ale[ale['Name'].str.endswith('e')]

            Name  Age
1    Krishna Ale   53
2  Sanu Maya Ale   44
3      Suman Ale   26
4    Srijana Ale   23
7     Sushan Ale    1

In [9]:
ale[ale['Name'].str.endswith('r')]

               Name  Age
5   Sujan Ale Magar   23
6   Suraj Ale Magar   21

In [83]:
ale[ale['Name']=='Krishna Ale']

          Name  Age
1  Krishna Ale   53

In [85]:
ale_name=ale['Name'].str.contains('Ale')

In [83]:
ale['Name'][1].split(' ')

['Krishna', 'Ale']

In [81]:
mystr="Suraj Ale Magar.I am from chitwan"

In [88]:
mystr.split()

['Suraj', 'Ale', 'Magar']

In [90]:
mystr.split(' ')

['Suraj', 'Ale', 'Magar']

In [91]:
mystr.split('Ale')

['Suraj ', ' Magar']

In [89]:
mystr.split(maxsplit=4)
ale.columns.str.len()

Int64Index([4, 3], dtype='int64')

In [90]:
ale.columns.str.len()

Int64Index([4, 3], dtype='int64')

In [91]:
ale.columns.str.upper()

Index(['NAME', 'AGE'], dtype='object')

In [103]:
ale.columns=ale.columns.str.upper()

In [104]:
ale

              NAME  AGE
1      Krishna Ale   53
2    Sanu Maya Ale   44
3        Suman Ale   26
4      Srijana Ale   23
5  Sujan Ale Magar   23
6  Suraj Ale Magar   21
7       Sushan Ale    1